api/app/controllers/api/v1/sound_vibes_controller.rb

SELECT "sound_vibes".* FROM "sound_vibes"
---
 def index
   @soundVibes = SoundVibe.all