api/app/controllers/api/v1/sounds_controller.rb

 def index
   @sounds = Sound.all
---
SELECT "sounds".* FROM "sounds"