api/app/controllers/api/v1/vibes_controller.rb

SELECT "vibes".* FROM "vibes"
---
 def index
   @vibes = Vibe.all

SELECT "sounds".* FROM "sounds"
INSERT INTO "sound_vibes" ("sound_id", "vibe_id", "volume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sound_id", 1], ["vibe_id", 1], ["volume", 0.0], ["created_at", "2018-09-12 16:02:33.916227"], ["updated_at", "2018-09-12 16:02:33.916227"]]
INSERT INTO "vibes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "farty"], ["created_at", "2018-09-12 16:02:33.910467"], ["updated_at", "2018-09-12 16:02:33.910467"]]
INSERT INTO "sound_vibes" ("sound_id", "vibe_id", "volume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sound_id", 1], ["vibe_id", 2], ["volume", 0.8], ["created_at", "2018-09-12 16:11:25.900242"], ["updated_at", "2018-09-12 16:11:25.900242"]]
INSERT INTO "vibes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "watery"], ["created_at", "2018-09-12 16:11:25.897516"], ["updated_at", "2018-09-12 16:11:25.897516"]]
---
 def create
   new_vibe = Vibe.new(name: params[:name])
     params[:sounds].each do |sound_data|
       new_vibe.sound_vibes << SoundVibe.create(sound_id: sound_data[:sound_id], volume: sound_data[:volume])
   end

   if new_vibe.save

SELECT  "vibes".* FROM "vibes" WHERE "vibes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def show
   @vibe = Vibe.find(params[:id])